In [1]:
%pip install pandas

Collecting pandasNote: you may need to restart the kernel to use updated packages.

  WARNING: The scripts f2py.exe and numpy-config.exe are installed in 'c:\Users\User\AppData\Local\Programs\Python\Python312\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.

  Downloading pandas-2.2.2-cp312-cp312-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.1.1-cp312-cp312-win_amd64.whl.metadata (59 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.2-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.5 MB 2.8 MB/s eta 0:00:04
   --- ------------------------------------ 1.0/11.5 MB 2.6 MB/s eta 0:00:04
   ----- ---------------------------------- 1.6/11.5 MB 2.7 MB/s eta 0:00:04
   -------- ------------------------------- 2.4/11.5 MB 2.9 MB/s eta 0:00:04
   ---------- ----------------------------- 3.1/11.5 MB 3.0 MB/s eta 0:00:03
   ------------ --------------------------- 3.7/11.5 MB 2.9 MB/s eta 0:00:03
   -------------- ------------------------- 4.2/11.5 MB 3.0 MB/s eta 0:00:03
   ----------------- ---------------------- 5.0/11.5 MB 3.0 MB/s eta 0:00:03
   ------------------- -------------------- 5.5/11.5 MB 3.0 MB/s eta 0:00:03
   --------------------- ------------------ 6.3/11.5 MB 3.0 MB/s eta 0:00:02
   ------------------------- -------------- 7.3/11.5 MB 3.1 MB/s eta 0:00:02
   ---------------------------- ----------- 8.1/11.5 MB 3.2 MB/s eta 0:00:02
   ------------------------------- -------- 8.9/11.5 MB 3.3 MB/s eta 0:00:01
   --------------------------------- ------ 9.7/11.5 MB 3.3 MB/s eta 0:00:01
   ------------------------------------ --- 10.5/11.5 MB 3.3 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 3.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 3.4 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 3.1 MB/s eta 0:00:00
Downloading numpy-2.1.1-cp312-cp312-win_amd64.whl (12.6 MB)
   ---------------------------------------- 0.0/12.6 MB ? eta -:--:--
   --- ------------------------------------ 1.0/12.6 MB 5.0 MB/s eta 0:00:03
   ----- ---------------------------------- 1.8/12.6 MB 4.6 MB/s eta 0:00:03
   -------- ------------------------------- 2.6/12.6 MB 4.3 MB/s eta 0:00:03
   ----------- ---------------------------- 3.7/12.6 MB 4.3 MB/s eta 0:00:03
   -------------- ------------------------- 4.5/12.6 MB 4.3 MB/s eta 0:00:02
   ----------------- ---------------------- 5.5/12.6 MB 4.2 MB/s eta 0:00:02
   -------------------- ------------------- 6.3/12.6 MB 4.3 MB/s eta 0:00:02
   ----------------------- ---------------- 7.3/12.6 MB 4.3 MB/s eta 0:00:02
   ------------------------- -------------- 8.1/12.6 MB 4.3 MB/s eta 0:00:02
   ----------------------------- ---------- 9.2/12.6 MB 4.3 MB/s eta 0:00:01
   -------------------------------- ------- 10.2/12.6 MB 4.4 MB/s eta 0:00:01
   ----------------------------------- ---- 11.3/12.6 MB 4.4 MB/s eta 0:00:01
   ---------------------------------------  12.3/12.6 MB 4.5 MB/s eta 0:00:01
   ---------------------------------------  12.3/12.6 MB 4.5 MB/s eta 0:00:01
   ---------------------------------------- 12.6/12.6 MB 4.1 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.1.1 pandas-2.2.2 pytz-2024.2 tzdata-2024.1

In [2]:
%pip install numpy

Requirement already satisfied: numpy in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (2.1.1)Note: you may need to restart the kernel to use updated packages.

In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [6]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
dates = pd.date_range("20130101", periods=6)

In [8]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [10]:
df

                   A         B         C         D
2013-01-01 -0.643868 -0.086745  0.277142 -0.614985
2013-01-02  1.158787 -1.450775 -0.594636  1.122069
2013-01-03  0.184211  1.225420  0.121195  0.025365
2013-01-04  0.029780 -1.048208 -0.573042  0.855906
2013-01-05 -0.209059  0.409737  0.940817 -0.116918
2013-01-06 -0.374697 -0.707391 -1.662725 -0.626358

In [11]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [12]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [13]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [14]:
df.head()

                   A         B         C         D
2013-01-01 -0.643868 -0.086745  0.277142 -0.614985
2013-01-02  1.158787 -1.450775 -0.594636  1.122069
2013-01-03  0.184211  1.225420  0.121195  0.025365
2013-01-04  0.029780 -1.048208 -0.573042  0.855906
2013-01-05 -0.209059  0.409737  0.940817 -0.116918

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.024192 -0.276327 -0.248541  0.107513
std    0.628135  0.992251  0.900291  0.735813
min   -0.643868 -1.450775 -1.662725 -0.626358
25%   -0.333287 -0.963004 -0.589237 -0.490468
50%   -0.089639 -0.397068 -0.225924 -0.045777
75%    0.145603  0.285616  0.238155  0.648271
max    1.158787  1.225420  0.940817  1.122069

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.643868    1.158787    0.184211    0.029780   -0.209059   -0.374697
B   -0.086745   -1.450775    1.225420   -1.048208    0.409737   -0.707391
C    0.277142   -0.594636    0.121195   -0.573042    0.940817   -1.662725
D   -0.614985    1.122069    0.025365    0.855906   -0.116918   -0.626358

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.024192 -0.276327 -0.248541  0.107513
std    0.628135  0.992251  0.900291  0.735813
min   -0.643868 -1.450775 -1.662725 -0.626358
25%   -0.333287 -0.963004 -0.589237 -0.490468
50%   -0.089639 -0.397068 -0.225924 -0.045777
75%    0.145603  0.285616  0.238155  0.648271
max    1.158787  1.225420  0.940817  1.122069

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.643868 -0.086745  0.277142 -0.614985
2013-01-02  1.158787 -1.450775 -0.594636  1.122069
2013-01-03  0.184211  1.225420  0.121195  0.025365

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  1.158787 -1.450775 -0.594636  1.122069
2013-01-03  0.184211  1.225420  0.121195  0.025365
2013-01-04  0.029780 -1.048208 -0.573042  0.855906

In [24]:
df.mean()

A    0.024192
B   -0.276327
C   -0.248541
D    0.107513
dtype: float64

In [27]:
df.median()

A   -0.089639
B   -0.397068
C   -0.225924
D   -0.045777
dtype: float64

In [30]:
# 1. Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70000, 80000, 50000, 60000, 75000],
    'Department': ['HR', 'Finance', 'IT', 'Marketing', 'Finance']
}

In [31]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
 'Age': [24, 27, 22, 32, 29],
 'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
 'Salary': [70000, 80000, 50000, 60000, 75000],
 'Department': ['HR', 'Finance', 'IT', 'Marketing', 'Finance']}

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 412.0 bytes

In [34]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.024192 -0.276327 -0.248541  0.107513
std    0.628135  0.992251  0.900291  0.735813
min   -0.643868 -1.450775 -1.662725 -0.626358
25%   -0.333287 -0.963004 -0.589237 -0.490468
50%   -0.089639 -0.397068 -0.225924 -0.045777
75%    0.145603  0.285616  0.238155  0.648271
max    1.158787  1.225420  0.940817  1.122069

In [44]:
# 9. Pivot Table Example
pivot_table = df.pivot_table(values='Salary', index='Department', columns='City', aggfunc='mean', fill_value=0)
print("\nPivot Table:")
print(pivot_table)

Pivot Table:
City        Chicago  Houston  Los Angeles  New York  Phoenix
Department
Finance         0.0      0.0      80000.0       0.0  75000.0
HR              0.0      0.0          0.0   70000.0      0.0
IT          50000.0      0.0          0.0       0.0      0.0
Marketing       0.0  60000.0          0.0       0.0      0.0